/**
 * The data of food.
 *
 * @type {[string[], [string, number, number, boolean][] | () => [string, number, number, boolean][]][]}
 */

// 回复，回复时间，加好感度数，是否判断为吃过
const food_data = [
    [
        ["冰淇淋", "雪糕"],
        [["不会是刺客吧（逃", 500, 0, false], ["不过还是投喂成功！好感度+2", 4000, 2, true]],
    ],
    [
        ["天赋党", "家长党", "双性党", "中奖党", "年龄党", "小朋友", "欣然", "某只小朋友", "柴柴"],
        function () {
            const eat = [
                "煲汤吃掉",
                "一口吞掉",
                "煮了吃掉",
                "抓来做汤",
                "她这么可爱为什么吃她pwq……个鬼啦当然要好好的吃掉",
                "煲汤煲汤",
            ];
            const eat_text = eat[Math.floor(Math.random() * eat.length)];
            return [[`aww${eat_text}！好感度+2`, 500, 2, true]];
        }
    ],
    [
        [
            "雌二醇", "戊酸雌二醇", "补佳乐", "色普龙", "螺内酯", "醋酸环丙孕酮", "日雌",
            "爱斯妥", "雌二醇凝胶", "凝胶", "十一酸睾酮", "雌二醇贴片", "糖", "孕激素", "雄激素",
            "妈富隆", "悦可婷", "非那雄胺", "比卡鲁胺", "度他雄胺", "睾酮", 
        ],
        [["机械琳酱不吃糖糖pwq", 500, 0.1, false]],
    ],
    [
        ["hina", "ひな", "云吞"],
        [["ひな好吃（逃（好感度+2", 500, 2, true]],
    ],
    [
        ["企鹅"],
        [["和小朋友一起炖了！（好感度+2", 500, 2, true]],
    ],
    [
        ["琳酱"],
        [["我才不吃自己呢！", 500, 0.02, false]],
    ],
    [
        ["linca", "锦心"],
        [["锦心那么可爱，不吃锦心w", 500, 0.02, false]],
    ],
    [
        ["seni", "senioria", "刺猬", "小刺猬"],
        [["seni那么可爱，不吃seniw", 500, 0.02, false]],
    ],
    [
        ["F2+B2", "FFBB", "F²+B²"],
        [["好感度过高，不忍心吃x", 500, 0.02, false]],
    ],
    [
        ["魔理沙", "枍安", "ecih", "无语魔理沙", "雾与魔理沙", "moi", "usamoi", "Arts", "天酱"],
        [["可爱爱，不吃吃x", 500, 0.02, false]],
    ],
    [
        [
            "西瓜", "水果", "冰棍", "口香糖", "卫龙", "香蕉", "牛奶", "旺旺", "碎冰冰", "火龙果", "苹果", "梨",
            "梨子", "山楂", "枇杷", "樱桃", "梅子", "李子", "草莓", "蓝莓", "西梅", "黑莓", "米饭", "蔬菜", "饭",
            "酸橙", "柚子", "柠檬", "橙子", "青柠", "哈密瓜", "香瓜", "甜瓜", "红枣", "提子", "葡萄", "蔓越莓",
            "腰果", "芒果", "猕猴桃", "菠萝", "小布丁", "老绿豆", "杨梅", "柿子", "木瓜", "桑葚", "无花果",
            "波罗蜜", "火龙果", "荔枝", "桂圆", "榴莲", "石榴", "椰子", "山竹", "百香果", "牛油果", "茄子",
            "白菜", "包菜", "神秘果", "大豆", "豆浆", "啤酒", "白酒", "酒", "苹果醋", "甘蔗", "番茄", "西红柿",
            "奶茶", "猪肉", "牛肉", "狗肉", "凉面", "白开水", "烤肉", "烤鱼", "蜗牛", "田螺", "土豆丝", "老婆饼",
            "寿司", "红茶", "猫猫", '小鸡炖蘑菇', '红烧排骨', '土豆泥', '阿拉斯加鲍鱼', '波士顿龙虾', '龙虾', '佛跳墙',
            '东北大乱炖', '四川九宫格', '鸳鸯锅', '红烧猪蹄', '炖肘子', '荷兰豆', '酸菜熘粉条', "酒", 
            '小葱拌豆腐', '热干面', '烤全羊', '烤馕', '鱼头泡饼', '可乐鸡翅', '红烧牛肉面', '糖炒栗子', '盐水鸭', '卤蛋',
            '兰州拉面', '口水鸭', '大盘鸡', '海底捞', '狗不理', '大列巴', '成吉斯汗火锅', '烤包子', '马迭尔冰棍', '大马哈鱼籽拌饭',
            '芒果冰', '水煮肉片', '湄公河烤鱼', '烤乳猪', '黄油烤面包', '煮卷心菜', '老坛酸菜牛肉面', '海南粉', '椰子饭',
            '加积鸭', '黄焖鸡米饭', '凉粉', '炸酱面', '凉面', '牛肉粉', '海鲜面', '马骨粉', '地三鲜', '石锅拌饭', '盐水虾',
            '醉蟹', '罗宋汤', '宫保鸡丁', '清蒸大闸蟹', '焦糖布丁', '鸭血粉丝汤', '沙丁鱼', '金枪鱼', '三文鱼片', '泡椒凤爪',
            '咖喱鸡块', '滕椒麻鸡', '酱汁排骨', '死神辣条', '死神辣酱拌面', '死神锅巴', '老干妈煎肉', '麻辣香锅', '麻婆豆腐',
            '麻辣烫', '安徽鸭叫跳', '猫不闻', '滕椒排骨', '蜜薯地瓜干', '叫花鸡', '干红辣椒炒鸭舌', '酱牛肉', '蛋花', '摩卡',
            '奶糖', '丸子', '虾饺', '桃酥', '抹茶', '红豆', '洋芋', '椰蓉', '布丁', '可可', '蛋筒', '糖豆', '松露',
            '奶茶', '肉松', '粉果', '牛奶', '豆奶', '春卷', '年糕', '泡芙', '吐司', '奶酪', '蛋挞', '肠粉', '冰沙',
            '慕斯', '奶昔', '曲奇', '果冻', '羊羹', '刨冰', '薄饼', '草饼', '香辣鱿鱼丝', '香辣鱿鱼块', '碳烤鱿鱼丝',
            '香辣小银鱼', '香辣红娘鱼', '碳烤鱿鱼仔', '泡椒鱿鱼须', '碳烤鱿鱼足', '蜜汁猪肉脯', '麻辣猪肉铺', '麻辣牛肉',
            '牛肉丝', '鹌鹑蛋', '猪肉丝', 'xo牛肉粒', 'Q肉', 'QQ肠', "QQ糖", '秘制牛肉棒', '独家牛肉', '天椒麻牛', '香辣猪脆骨',
            ' 香辣牛板筋', '果蔬干', '芒果干', '榴莲干', '杨梅干', '菠萝蜜', '玉米粒', '红枣片', '香蕉片', '金桔干', '紫薯干',
            '猕猴桃干', '无花果干', '草莓冻干', '草莓蜜饯', '柠檬蜜饯', '秋葵干', '蔬菜干', '菠萝圈', '香芋干', '半边梅',
            '水果冻干', '海苔豆', '盐津葡萄干', '榴莲条冻干', '藕片', '黑加仑', '蔓越莓沙琪玛', '蔓越莓曲奇饼干', '黄金肉松条',
            '印尼威化饼干', '椰丝米糕', '椰蓉球', '椰子酥', '椰子片', '蓝莓奶酪片', '奶酪玉米棒', '秘制豆腐干', '甜甜圈',
            '冰淇淋饼干', '奶酪起司蛋糕', ' 可比克', '妙脆角', '雪丽糍', '芝士条', '艾比利', '好丽友', '好多鱼', '徐福记',
            '鲜虾片', '粟米条', '荷兰豆', '保龄豆', '玉米花', '烧贝壳', '铜锣烧', '瑞士莲', '蛋黄派', '卷卷芯', '喜之郎',
            '香辣鱿鱼丝', '香辣鱿鱼块', '碳烤鱿鱼丝', '香辣小银鱼', '香辣红娘鱼', '碳烤鱿鱼仔', '泡椒鱿鱼须', '碳烤鱿鱼足',
            '蜜汁猪肉脯', '麻辣猪肉铺', '麻辣牛肉', '牛肉丝', '鹌鹑蛋', '猪肉丝', 'xo牛肉粒', 'Q肉', 'QQ肠', '秘制牛肉棒',
            '独家牛肉', '天椒麻牛', '香辣猪脆骨', '香辣牛板筋', '果蔬干', '芒果干', ' 榴莲干', '杨梅干', '菠萝蜜', '玉米粒',
            '红枣片', '香蕉片', '金桔干', '紫薯干', '猕猴桃干', '无花果干', '草莓冻干', '草莓蜜饯', '柠檬蜜饯', '秋葵干',
            '蔬菜干', '菠萝圈', '香芋干', '半边梅', '水果冻干', '海苔豆', '盐津葡萄干', '榴莲条冻干', '藕片', '黑加仑', '蔓越莓沙琪玛',
            '蔓越莓曲奇饼干', '黄金肉松条', '印尼威化饼干', '椰丝米糕', '椰蓉球', '椰子酥', '椰子片', '蓝莓奶酪片', '奶酪玉米棒',
            '秘制豆腐干', '甜甜圈', '冰淇淋饼干', '奶酪起司蛋糕', ' 可比克', '妙脆角', '雪丽糍', '芝士条', '艾比利', '好丽友', '好多鱼',
            '徐福记', '鲜虾片', '粟米条', '果冻', '薯片', '爆米花', '水果糖', '棒棒糖果脯', '蜜饯', "巧克力",
            '话梅', '话李', '干脆面', '饼干', '泡泡糖', '口香糖', '膨化小食品', '葵花', '花生', '核桃',
            '奶糖', '芝麻糊', '奶酪固齿', '葡萄干', '薄荷糖', '无花果', '南瓜', '子和开心果', '柑桔', '橙子', '桔子',
            '乳饮料', '牛肉干', '烤鱼片', '香辣鳗鱼丝', '馄饨', "蛋糕", "面包", "鲍鱼"
        ],
        [["投喂成功！好感度+2", 500, 2, true]],
    ],
    [
        ["昏睡红茶", "野兽先辈", "田所浩二"],
        [["啊啊啊啊啊啊啊啊啊啊啊（吼叫", 500, 1, true]],
    ],
    [
        ["鸡鸡", "jb", "鸡巴", "奶子", '核弹', "铀-235", "毒药"],
        [["不准这样对琳酱！（好感度-2）", 500, -2, false]],
    ]
];

// Preprocess food data
/** @type {Map<string, () => [string, number][]>} */
let food_map = new Map();
for (let [names, fn] of food_data) {
    if (fn instanceof Array) {
        let ctnt = fn;
        fn = () => ctnt;
    }
    for (let n of names) {
        food_map.set(n, fn);
    }
}

/**
 * Generate the feeding message.
 *
 * @param {string} name The name of the food
 *
 * @returns {[string, number][]} A list of feeding message.
 */
export function generate_feed_food(name) {
    if (!food_map.has(name)) {
        return [["琳酱不认识，不要给我吃奇怪的东西pwq", 500, 0, false]];
    }
    else {
        return food_map.get(name)();
    }
}

